init; format long;

% As restrições são representadas matricialmente, logo, cada linha da
% matriz A representa uma retrição de desigualdade, enquanto cada linha da
% matriz Aeq representa uma restrição de igualdade. 

% Restrições de desigualdade
A = [-50.6 -1.23 -1.13 -0.71 -1.03 0 -0.93 
     50.6 1.23 1.13 0.71 1.03 0 0.93
     -5.04  -61.62  -93  -7.6 -9.32 0 -1.93
     5.04 61.62 93 7.6 9.32 0 1.93 
     -1.19 -16.59 -2.87 -1.13 -5.08 0 -0.09
     1.19 16.59 2.87 1.13 5.08 0 0.09
     -0.67 -9.01 -1.2 -82.97 -7.21 0 -0.13 
     0.67 9.01 1.2 82.97 7.21 0 0.13
     0.78 0 0.1 0 0.44 0 0.12 
     -0.762 -2.74 -83.64 185.83 18.96 0 -1.422
     0.018 -7.5 82.011 -219.47 -23.88 0 1.335
     -0.319 -4.877 -1.31 106.73 4.29 0 0.074
     -0.619 -7.737 -0.37 -222.88 -14.387 0 -0.25
     -38.24 155.67 173.6 164.34 37.86 0 2.93
     35.48 -190.65 -212.43 -201 -46.51 0 -3.78
     0 0 0 0 0.046 0.07 0.0123
     0 0 0 0 25392 34436 0];

b = [-62 67 -9 25 -2 9 -1 5 6.5 0 0 0 0 0 0 0.05 2700];

% Restrições de igualdade
Aeq = [0 0 0 0 25392 34436 32100
       0 0 0 0 0 0 32100];
beq = [3600 900];

% Restrições laterais
lb = [0 0 0 0 0 0 0];

f = [0.93 0.54 1.54 0.77 35 40 -50];

x = linprog(f,A,b,Aeq,beq,lb);

C = f*x;

display(x);
display(C);

